#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [3]:
import pandas as pd

In [3]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
pd.Series(data)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [13]:
## Dataframe
## create a Dataframe from a dictionary oof list

data={
    'Name':['Rohit','Rohit 2','Rohit 3'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0    Rohit   25  Bangalore
1  Rohit 2   30   New York
2  Rohit 3   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [8]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [10]:
df=pd.read_csv('sales_data.csv')
df.head(5) # top 5

,Transaction ID,Date,Pr oduct Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [11]:
df.tail(5) # last 5

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [17]:
### Accessing Data From Dataframe
df

      Name  Age       City
0    Rohit   25  Bangalore
1  Rohit 2   30   New York
2  Rohit 3   45    Florida

In [15]:
df['Name']

0      Rohit
1    Rohit 2
2    Rohit 3
Name: Name, dtype: object

In [23]:
df.loc[0] # row wise operation location

Name        Rohit
Age            25
City    Bangalore
Name: 0, dtype: object

In [24]:
df.iloc[0]  #column

Name        Rohit
Age            25
City    Bangalore
Name: 0, dtype: object

In [25]:
df.loc[0][0]

C:\Users\Rohit\AppData\Local\Temp\ipykernel_16300\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Rohit'

In [27]:
## Accessing a specified element
df.at[2,'Age']

np.int64(30)

In [28]:
df.at[2,'Name']

'Rohit 3'

In [38]:
## Accessing a specified element using iat
df.iat[2,2]

'Florida'

In [30]:
df

      Name  Age       City
0    Rohit   25  Bangalore
1  Rohit 2   30   New York
2  Rohit 3   45    Florida

In [29]:
### Data MAnipulation with Dataframe
df

      Name  Age       City
0    Rohit   25  Bangalore
1  Rohit 2   30   New York
2  Rohit 3   45    Florida

In [41]:
## Adding a column
df['Salary']=[50000,60000,70000]
df

    Name  Age       City  Salary
0  Krish   25  Bangalore   50000
1   John   30   New York   60000
2   Jack   45    Florida   70000

In [46]:
## Remove a column  #by default axis is 0 --> 1(column index) and to make in permannent opperation we use inplace=True
df.drop('Salary',axis=1,inplace=True)

In [31]:
df

      Name  Age       City
0    Rohit   25  Bangalore
1  Rohit 2   30   New York
2  Rohit 3   45    Florida

In [32]:
## Add age to the column
df['Age']=df['Age']+1
df

      Name  Age       City
0    Rohit   26  Bangalore
1  Rohit 2   31   New York
2  Rohit 3   46    Florida

In [33]:
df.drop(0,inplace=True) # first row removed default axix -0 (row)

In [34]:
df

      Name  Age      City
1  Rohit 2   31  New York
2  Rohit 3   46   Florida

In [53]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [54]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [55]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

## Numeric Types

### `int`
- **`int8`**: 8-bit integer
- **`int16`**: 16-bit integer
- **`int32`**: 32-bit integer
- **`int64`**: 64-bit integer
- **`uint8`**: Unsigned 8-bit integer
- **`uint16`**: Unsigned 16-bit integer
- **`uint32`**: Unsigned 32-bit integer
- **`uint64`**: Unsigned 64-bit integer

### `float`
- **`float16`**: Half-precision floating-point
- **`float32`**: Single-precision floating-point
- **`float64`**: Double-precision floating-point

### `complex`
- **`complex64`**: 64-bit complex number
- **`complex128`**: 128-bit complex number

## String Types

### `object`
- Used for general-purpose Python objects, often strings.

### `string`
- A dedicated string type introduced in pandas 1.0.0 and later for more efficient string handling.

## Boolean Type

### `bool`
- Boolean values (`True` or `False`).

## Date and Time Types

### `datetime64`
- For date and time values. Includes:
  - **`datetime64[ns]`**: Nanosecond precision

### `timedelta64`
- For differences between dates and times. Includes:
  - **`timedelta64[ns]`**: Nanosecond precision

### `Period`
- Represents a period of time, like months or years.

### `DatetimeIndex`
- Special index type for datetime data.

## Categorical Types

### `category`
- For categorical data with a fixed number of possible values (categories). Useful for categorical variables with a limited set of values.

## Specialized Types

### `Sparse`
- For sparse data structures that contain many missing values or zeroes.

### `Interval`
- For interval data that falls within a range of values.

### `string` (Pandas Extension)
- For extension types that offer additional functionalities, such as string operations.